
&НаКлиенте
Процедура ЭкспонатыЭкспонатПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Экспонаты.ТекущиеДанные;
	Информация = ПолучитьИнформациюОКТ(СтрокаТабличнойЧасти.Экспонат);
	СтрокаТабличнойЧасти.Идентификатор = Информация[0];
	СтрокаТабличнойЧасти.НазваниеЭкспоната = Информация[1];
	СтрокаТабличнойЧасти.Ячейка = Информация[2];       
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОКТ(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	Экспонаты.Идентификатор КАК Идентификатор,
	|	Экспонаты.НазваниеЭкспоната КАК НазваниеЭкспоната,
	|	ЭкспонатыНаСкладахОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Экспонаты КАК Экспонаты
	|		ПО ЭкспонатыНаСкладахОстатки.Экспонат = Экспонаты.Ссылка
	|ГДЕ
	|	Экспонаты.Ссылка = &Ссылка
	|	И ЭкспонатыНаСкладахОстатки.КоличествоОстаток > 0
	|	И ЭкспонатыНаСкладахОстатки.Экспонат.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.Идентификатор);
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.НазваниеЭкспоната);
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.Ячейка);
	КонецЦикла; 
	
	Возврат МассивДанных;
КонецФункции        

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Файлы
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда		
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КонецЕсли; 
	
КонецПроцедуры


//Файлы
&НаКлиенте
Процедура Загрузить(Команда)   
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);   
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(ОписаниеФайла, ДопПараметры) Экспорт      
	Попытка
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли; 
	
	АдресВХранилище = ОписаниеФайла.Адрес;
	Объект.ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Файл.Имя;
	
	Модифицированность = Истина;
	Исключение        
	    Предупреждение("Форма выбора файла была закрыта. Файл не выбран.");
	КонецПопытки;
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)
	Попытка
		СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
		ПолучитьФайл(СсылкаНаФайлВИБ,Объект.ИмяФайла);
	Исключение
		Предупреждение("Перед тем как скачивать файл, его нужно загрузить.");
	КонецПопытки;
КонецПроцедуры                         



 
