
Процедура ПриНачалеРаботыСистемы()
	Таймер = Общий.Таймер();
	Если Таймер = 0 Тогда
		Таймер = 60;
	КонецЕсли;
	
	ТаймерТГ = Общий.ТаймерТГ();
	Если ТаймерТГ = 0 Тогда
		ТаймерТГ = 60;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьСклад", Таймер, Ложь);
	ПодключитьОбработчикОжидания("ОбменСБотом", ТаймерТГ, Ложь);
	
	Общий.ЗаполнитьСлужебныеСправочники();
КонецПроцедуры


Процедура ПроверитьСклад() Экспорт
	
	Общий.ОтслеживаниеСостоянияСклада();
	
КонецПроцедуры

Процедура ОбменСБотом() Экспорт
	
	Общий.ОбменСБотомТГ();
	
КонецПроцедуры

