
&НаСервере
Процедура ЭкспонатыЯчейкаПриИзмененииНаСервере(Ячейка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкспонатыНаСкладахОстатки.Ячейка КАК Ячейка,
		|	ЭкспонатыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Остатки(, Ячейка = &Ячейка) КАК ЭкспонатыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	РезультатПустой = Запрос.Выполнить().Пустой();	
	Если Не РезультатПустой Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ячейка не пустая";
		Сообщение.Сообщить();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспонатыЯчейкаПриИзменении(Элемент)
	ЭкспонатыЯчейкаПриИзмененииНаСервере(Элементы.Экспонаты.ТекущиеДанные.Ячейка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидПриемки = Перечисления.ВидыПриемкиЭкспонатов.Ручной;
		Объект.Ответственный = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;
	
	РежимВводаДанных();
	
КонецПроцедуры

&НаСервере
Процедура РежимВводаДанных()
	
	Если Объект.ВидПриемки = Перечисления.ВидыПриемкиЭкспонатов.Автоматический Тогда
		Элементы.ЭкспонатыЯчейка.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЭкспонатыЯчейка.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриемкиПриИзменении(Элемент)
	РежимВводаДанных();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспонатыЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("МаленькийЭкспонат", Элементы.Экспонаты.ТекущиеДанные.МаленькийЭкспонат);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЯчейку", ЭтаФорма);
	ОткрытьФорму("Справочник.Ячейки.Форма.ФормаВыбора",Отбор,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЯчейку(Ячейка, пар2) Экспорт
	
	Если ТипЗнч(Ячейка) = Тип("СправочникСсылка.Ячейки") Тогда
		Элементы.Экспонаты.ТекущиеДанные.Ячейка = Ячейка;
	КонецЕсли;
	
КонецПроцедуры


//Файлы
&НаКлиенте
Процедура Загрузить(Команда)   
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);   
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(ОписаниеФайла, ДопПараметры) Экспорт      
	Попытка
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли; 
	
	АдресВХранилище = ОписаниеФайла.Адрес;
	Объект.ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Файл.Имя;
	
	Модифицированность = Истина;
	Исключение        
	    Предупреждение("Форма выбора файла была закрыта. Файл не выбран.");
	КонецПопытки;
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)
	Попытка
		СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
		ПолучитьФайл(СсылкаНаФайлВИБ,Объект.ИмяФайла);
	Исключение
		Предупреждение("Перед тем как скачивать файл, его нужно загрузить.");
	КонецПопытки;
КонецПроцедуры                         

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда		
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КонецЕсли;   
	
	Если Объект.ПолучательУведомлений.Пустая() Тогда
		Объект.ПолучательУведомлений = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры
