
Процедура ОтслеживаниеСостоянияСклада() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ячейки.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КолВо
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
	|		ПО Ячейки.Ссылка = ЭкспонатыНаСкладахОстатки.Ячейка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ячейки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.КолВо КАК КолВо
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.КолВо = 0";
	
	Если Запрос.Выполнить().Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Склад заполнен, необходимо сделать перераспределение";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменСБотомТГ() Экспорт
	
	Telegram_Сервер.ОтправитьСообщениеОПриемеЭкспоната();
	//Telegram_Сервер.ОтправитьСообщениеОСрокеЭкспоната();
	Telegram_Сервер.ОтправитьСообщениеООтправкеЭкспоната();
	
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
	
КонецПроцедуры

Функция Таймер() Экспорт
	
	Возврат Константы.ВремяПроверкиЗаполненияСклада.Получить();
	
КонецФункции

Функция ТаймерТГ() Экспорт
	
	Возврат Константы.ВремяОбменаСТГБотом.Получить();
	
КонецФункции


Процедура ЗаполнитьСлужебныеСправочники() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Служебный_Время.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Служебный_Время КАК Служебный_Время";
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		Сч = 0;
		
		Пока Сч <= 23 Цикл
			
			НовыйЭлемент = Справочники.Служебный_Время.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Сч;
			НовыйЭлемент.Час          = Сч;
			НовыйЭлемент.Записать();
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры