

Процедура ОбработкаПроведения(Отказ, Режим)
	
	  
	Для Каждого ТекСтрокаЭкспонаты Из Экспонаты Цикл
     
	// регистр ЭкспонатыНаСкладах Приход
    Движения.ЭкспонатыНаСкладах.Записывать = Истина;
	Движение = Движения.ЭкспонатыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Ячейка = ТекСтрокаЭкспонаты.ЯчейкаПриемник;
	Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
	Движение.Количество = 1;
	
	//регистр ЭкспонатыНаСкладах Расход
    Движения.ЭкспонатыНаСкладах.Записывать = Истина;
	Движение = Движения.ЭкспонатыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Ячейка = ТекСтрокаЭкспонаты.ЯчейкаИсходная;
	Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
	Движение.Количество = 1; 
	
	КонецЦикла;
	
КонецПроцедуры

