
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Приемка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Приемка.Дата,
	|	Приемка.Комментарий,
	|	Приемка.Номер,
	|	Приемка.Организация,
	|	Приемка.Ответственный,
	|	Приемка.Экспонаты.(
	|		НомерСтроки,
	|		Идентификатор,
	|		НазваниеЭкспоната,
	|		МаленькийЭкспонат,
	|		Ячейка,
	|		Экспонат
	|	)
	|ИЗ
	|	Документ.Приемка КАК Приемка
	|ГДЕ
	|	Приемка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЭкспонатыШапка = Макет.ПолучитьОбласть("ЭкспонатыШапка");
	ОбластьЭкспонаты = Макет.ПолучитьОбласть("Экспонаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЭкспонатыШапка);
		ВыборкаЭкспонаты = Выборка.Экспонаты.Выбрать();
		Пока ВыборкаЭкспонаты.Следующий() Цикл
			ОбластьЭкспонаты.Параметры.Заполнить(ВыборкаЭкспонаты);
			ТабДок.Вывести(ОбластьЭкспонаты, ВыборкаЭкспонаты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
