

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//регистр ЭкспонатыНаСкладах Расход
	Движения.ЭкспонатыНаСкладах.Записывать = Истина;  
	Для Каждого ТекСтрокаЭкспонаты Из Экспонаты Цикл
	Движение = Движения.ЭкспонатыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Ячейка = ТекСтрокаЭкспонаты.Ячейка;
	Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
	Движение.Количество = 1;     
	
	
	ЭкспонатОбъект = ТекСтрокаЭкспонаты.Экспонат.ПолучитьОбъект();
	ЭкспонатОбъект.ЭкспонатОтправлен = Истина; 
	ЭкспонатОбъект.Ячейка = Неопределено;	
	ЭкспонатОбъект.Записать(); 
	
	КонецЦикла;
	
КонецПроцедуры

