
&НаКлиенте
Процедура ЭкспонатыЭкспонатПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Экспонаты.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЯчейкаИсходная = ЗагрузитьЯчейку(СтрокаТабличнойЧасти.Экспонат);
КонецПроцедуры       

&НаСервере
Функция ЗагрузитьЯчейку(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкспонатыНаСкладахОстатки.Ячейка КАК ЯчейкаИсходная
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
		|ГДЕ
		|	ЭкспонатыНаСкладахОстатки.Экспонат = &Экспонат
		|	И ЭкспонатыНаСкладахОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Экспонат", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЯчейкаИсходная;
	КонецЦикла;

	
КонецФункции  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры     


&НаСервере
Процедура ЭкспонатыЯчейкаПриИзмененииНаСервере(ЯчейкаИсходная)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкспонатыНаСкладахОстатки.Ячейка КАК Ячейка,
		|	ЭкспонатыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Остатки(, Ячейка = &Ячейка) КАК ЭкспонатыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Ячейка", ЯчейкаИсходная);
	
	РезультатПустой = Запрос.Выполнить().Пустой();	
	Если Не РезультатПустой Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ячейка не пустая";
		Сообщение.Сообщить();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспонатыЯчейкаПриемникПриИзменении(Элемент)
	ЭкспонатыЯчейкаПриИзмененииНаСервере(Элементы.Экспонаты.ТекущиеДанные.ЯчейкаИсходная);
КонецПроцедуры

&НаКлиенте
Процедура ЭкспонатыЯчейкаПриемникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("МаленькийЭкспонат", Элементы.Экспонаты.ТекущиеДанные.МаленькийЭкспонат);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЯчейку", ЭтаФорма);
	ОткрытьФорму("Справочник.Ячейки.Форма.ФормаВыбора",Отбор,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЯчейку(Ячейка, пар2) Экспорт
	
	Если ТипЗнч(Ячейка) = Тип("СправочникСсылка.Ячейки") Тогда
		Элементы.Экспонаты.ТекущиеДанные.ЯчейкаПриемник = Ячейка;
	КонецЕсли;
	
КонецПроцедуры


 
