
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	День          = ТекущаяДата();
	Месяц.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца;
	НачалоПериода = НачалоГода(ТекущаяДата());
	КонецПериода  = КонецГода(ТекущаяДата());
	НачалоПериодаМесяц = НачалоМесяца(ТекущаяДата());
	КонецПериодаМесяц  = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВсеОтчетыЗаДень();
КонецПроцедуры

&НаКлиенте
Процедура СегодняКоманда(Команда)
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.СтраницаСегодня;
	ЗаполнитьВсеОтчетыЗаДень();
КонецПроцедуры

&НаКлиенте
Процедура ДеньПриИзменении(Элемент)
	ЗаполнитьВсеОтчетыЗаДень();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеОтчетыЗаДень()
	
	ЗаполнитьЭкспонатовОтправлено();
	ЗаполнитьЭкспонатовПринято();
	ЗаполнитьЗанятоЯчеек();
	
	ОтчетАктивностьЗаДень();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцКоманда(Команда)
	
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.СтраницаМесяц;

	СформироватьОтчетИтогиЗаМесяц();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеПоказтелиКоманда(Команда)
	
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.СтраницаОбщиеПоказатели;
	
	СформироватьОтчетПринятоотправленоЭкспонатов();
	
	
КонецПроцедуры


#Область ЗаполнениеДашборда

Процедура ЗаполнитьЭкспонатовОтправлено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЭкспонатыНаСкладахОбороты.КоличествоРасход) КАК Количество
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ЭкспонатыНаСкладахОбороты
		|ГДЕ
		|	ЭкспонатыНаСкладахОбороты.Регистратор ССЫЛКА Документ.Отправка";
	
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(День));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭкспонатовОтправлено = ВыборкаДетальныеЗаписи.Количество;
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЭкспонатовПринято()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЭкспонатыНаСкладахОбороты.КоличествоПриход) КАК Количество
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ЭкспонатыНаСкладахОбороты
		|ГДЕ
		|	ЭкспонатыНаСкладахОбороты.Регистратор ССЫЛКА Документ.Приемка";
	
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(День));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭкспонатовПринято = ВыборкаДетальныеЗаписи.Количество;
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗанятоЯчеек()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
		|		ПО Ячейки.Ссылка = ЭкспонатыНаСкладахОстатки.Ячейка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ячейки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВТ.КоличествоОстаток > 0
		|			ТОГДА 1
		|	КОНЕЦ КАК Занято,
		|	ВЫБОР
		|		КОГДА ВТ.КоличествоОстаток = 0
		|			ТОГДА 1
		|	КОНЕЦ КАК Свободно
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ2.Занято) КАК Занято,
		|	СУММА(ВТ2.Свободно) КАК Свободно
		|ИЗ
		|	ВТ2 КАК ВТ2";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗанятоЯчеек = ВыборкаДетальныеЗаписи.Занято;
		СвободноЯчеек = ВыборкаДетальныеЗаписи.Свободно;
	КонецЦикла;

	
КонецПроцедуры


#КонецОбласти

#Область ОтчетАктивностьЗаДень

&НаКлиенте
Процедура ОтчетАктивностьЗаДень()
	
	ДиаграммаАктивности.Очистить();
	ДиаграммаАктивности.АвтоТранспонирование = ЛОЖЬ;
	ДиаграммаАктивности.Обновление           = ЛОЖЬ;
	ДиаграммаАктивности.ТипДиаграммы         = ТипДиаграммы.Гистограмма;
	
	ДиаграммаАктивности.Серии.Добавить("Принято экспонатов");
	ДиаграммаАктивности.Серии.Добавить("Отправлено экспонатов");
	
	ДанныеДиаграммы = ПолучитьДанныеДляОтчетаАктивностьЗаДень();
	
	Для Сч = 0 По ДанныеДиаграммы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеДиаграммы["Запись" + Сч];
		Точка = ДиаграммаАктивности.УстановитьТочку(Формат(ДанныеСтроки.Время,"ДЧ=ЧЧ"));
		
		ДиаграммаАктивности.УстановитьЗначение(Точка
		, ДиаграммаАктивности.Серии[0]
		, ДанныеСтроки.ПринятоЭкспонатов
		, Неопределено
		, "Принято экспонатов");
		
		ДиаграммаАктивности.УстановитьЗначение(Точка
		, ДиаграммаАктивности.Серии[1]
		, ДанныеСтроки.ОтправленоЭкспонатов
		, Неопределено
		, "Отправлено экспонатов");
		
	КонецЦикла;
	
	ДиаграммаАктивности.АвтоТранспонирование = Истина;
	ДиаграммаАктивности.Обновление           = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеДляОтчетаАктивностьЗаДень()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, Служебный_Время.Час) КАК Время,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоПриход, 0)) КАК ПринятоЭкспонатов,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоРасход, 0)) КАК ОтправленоЭкспонатов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Служебный_Время КАК Служебный_Время
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЭкспонатыНаСкладах.Обороты(, , Час, ) КАК ЭкспонатыНаСкладахОбороты
		|		ПО (ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, Служебный_Время.Час) = НАЧАЛОПЕРИОДА(ЭкспонатыНаСкладахОбороты.Период, ЧАС))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, Служебный_Время.Час)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Время КАК Время,
		|	СУММА(ВТ.ПринятоЭкспонатов) КАК ПринятоЭкспонатов,
		|	СУММА(ВТ.ОтправленоЭкспонатов) КАК ОтправленоЭкспонатов
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Время";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(День));
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ПрНомерЗаписи = 0;
	СтруктураДанных = Новый Структура;
	
	Для Каждого ТекСтрока Из ТаблицаЗначений Цикл 
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Время", ТекСтрока.Время);
		СтруктураСтроки.Вставить("ПринятоЭкспонатов", ТекСтрока.ПринятоЭкспонатов);
		СтруктураСтроки.Вставить("ОтправленоЭкспонатов", ТекСтрока.ОтправленоЭкспонатов);
		СтруктураДанных.Вставить("Запись" + Строка(ПрНомерЗаписи), СтруктураСтроки);
		
		ПрНомерЗаписи = ПрНомерЗаписи + 1;
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область МесяцОбласть

Процедура СФормироватьИтогиЗаМесяц()
	
	ИтогиМесяца.Параметры.УстановитьЗначениеПараметра("НачалоМесяца", НачалоМесяца(Месяц.Дата));
	ИтогиМесяца.Параметры.УстановитьЗначениеПараметра("КонецМесяца", КонецМесяца(Месяц.Дата));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетИтогиЗаМесяц()
	
	ДиаграммаОценки.Очистить();
	ДиаграммаОценки.АвтоТранспонирование = ЛОЖЬ;
	ДиаграммаОценки.Обновление           = ЛОЖЬ;
	ДиаграммаОценки.ТипДиаграммы         = ТипДиаграммы.Гистограмма;
	
	ДанныеДиаграммы = ПолучитьДанныеДляОтчетаИтогиЗаМесяц();
	
	ДиаграммаОценки.Серии.Добавить("Принято заказов");
	ДиаграммаОценки.Серии.Добавить("Выдано заказов");
	
	Для Сч = 0 По ДанныеДиаграммы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеДиаграммы["Запись" + Сч];
		Точка = ДиаграммаОценки.УстановитьТочку(Формат(ДанныеСтроки.Время,"ДФ=МММ-гггг"));
		
		ДиаграммаОценки.УстановитьЗначение(Точка
		, ДиаграммаОценки.Серии[0]
		, ДанныеСтроки.ПринятоЗаказов
		, Неопределено
		, "Принято заказов");
		
		ДиаграммаОценки.УстановитьЗначение(Точка
		, ДиаграммаОценки.Серии[1]
		, ДанныеСтроки.ВыданоЗаказов
		, Неопределено
		, "Выдано заказов");
		
	КонецЦикла;
	
	ДиаграммаОценки.АвтоТранспонирование = Истина;
	ДиаграммаОценки.Обновление           = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеДляОтчетаИтогиЗаМесяц()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоПриход, 0)) КАК ПринятоЗаказов,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоРасход, 0)) КАК ВыданоЗаказов,
		|	НАЧАЛОПЕРИОДА(ЭкспонатыНаСкладахОбороты.Период, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Обороты(&НачалоПериодаМесяц, &КонецПериодаМесяц, Месяц, ) КАК ЭкспонатыНаСкладахОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЭкспонатыНаСкладахОбороты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ.ПринятоЗаказов) КАК ПринятоЗаказов,
		|	СУММА(ВТ.ВыданоЗаказов) КАК ВыданоЗаказов,
		|	ВТ.Месяц КАК Месяц
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Месяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц";
	
	Запрос.УстановитьПараметр("КонецПериодаМесяц", КонецДня(КонецПериодаМесяц));
	Запрос.УстановитьПараметр("НачалоПериодаМесяц", НачалоПериодаМесяц);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ПрНомерЗаписи = 0;
	СтруктураДанных = Новый Структура;
	
	Для Каждого ТекСтрока Из ТаблицаЗначений Цикл 
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Время", ТекСтрока.Месяц);
		СтруктураСтроки.Вставить("ПринятоЗаказов", ТекСтрока.ПринятоЗаказов);
		СтруктураСтроки.Вставить("ВыданоЗаказов", ТекСтрока.ВыданоЗаказов);
		СтруктураДанных.Вставить("Запись" + Строка(ПрНомерЗаписи), СтруктураСтроки);
		
		ПрНомерЗаписи = ПрНомерЗаписи + 1;
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область ИтогиПоХранению

&НаКлиенте
Процедура СформироватьОтчетПринятоотправленоЭкспонатов()
	
	ДиаграммаАктивностьПоМесяцам.Очистить();
	ДиаграммаАктивностьПоМесяцам.АвтоТранспонирование = ЛОЖЬ;
	ДиаграммаАктивностьПоМесяцам.Обновление           = ЛОЖЬ;
	ДиаграммаАктивностьПоМесяцам.ТипДиаграммы         = ТипДиаграммы.Гистограмма;
	
	ДанныеДиаграммы = ПолучитьДанныеДляОтчетаПринятоОтправленоЭкспонатов();
	
	ДиаграммаАктивностьПоМесяцам.Серии.Добавить("Принято экспонатов");
	ДиаграммаАктивностьПоМесяцам.Серии.Добавить("Отправлено экспонатов");
	
	Для Сч = 0 По ДанныеДиаграммы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеДиаграммы["Запись" + Сч];
		Точка = ДиаграммаАктивностьПоМесяцам.УстановитьТочку(Формат(ДанныеСтроки.Время,"ДФ=МММ-гггг"));
		
		ДиаграммаАктивностьПоМесяцам.УстановитьЗначение(Точка
		, ДиаграммаАктивностьПоМесяцам.Серии[0]
		, ДанныеСтроки.ПринятоЭкспонатов
		, Неопределено
		, "Принято экспонатов");
		
		ДиаграммаАктивностьПоМесяцам.УстановитьЗначение(Точка
		, ДиаграммаАктивностьПоМесяцам.Серии[1]
		, ДанныеСтроки.ОтправленоЭкспонатов
		, Неопределено
		, "Отправлено экспонатов");
		
	КонецЦикла;
	
	ДиаграммаАктивностьПоМесяцам.АвтоТранспонирование = Истина;
	ДиаграммаАктивностьПоМесяцам.Обновление           = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеДляОтчетаПринятоОтправленоЭкспонатов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоПриход, 0)) КАК ПринятоЭкспонатов,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОбороты.КоличествоРасход, 0)) КАК ОтправленоЭкспонатов,
		|	НАЧАЛОПЕРИОДА(ЭкспонатыНаСкладахОбороты.Период, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ЭкспонатыНаСкладахОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЭкспонатыНаСкладахОбороты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ.ПринятоЭкспонатов) КАК ПринятоЭкспонатов,
		|	СУММА(ВТ.ОтправленоЭкспонатов) КАК ОтправленоЭкспонатов,
		|	ВТ.Месяц КАК Месяц
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Месяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ПрНомерЗаписи = 0;
	СтруктураДанных = Новый Структура;
	
	Для Каждого ТекСтрока Из ТаблицаЗначений Цикл 
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Время", ТекСтрока.Месяц);
		СтруктураСтроки.Вставить("ПринятоЭкспонатов", ТекСтрока.ПринятоЭкспонатов);
		СтруктураСтроки.Вставить("ОтправленоЭкспонатов", ТекСтрока.ОтправленоЭкспонатов);
		СтруктураДанных.Вставить("Запись" + Строка(ПрНомерЗаписи), СтруктураСтроки);
		
		ПрНомерЗаписи = ПрНомерЗаписи + 1;
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти