
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Логин КАК Логин,
	|	Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Объект.Логин);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	
	Если Результат.Следующий() Тогда
		
		Если Результат.Количество() = 0 Или ТекущийОбъект.УникальныйИдентификатор = Результат.УникальныйИдентификатор Тогда
			
			ПользовательСсылка = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
			
			Если ПользовательСсылка = Неопределено Тогда
				
				НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
				НовыйПользователь.Имя = Объект.Логин;
				НовыйПользователь.Пароль = Объект.Пароль;
				НовыйПользователь.ПолноеИмя = Объект.Наименование;
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
				Иначе
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
				КонецЕсли;
				
				НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
				НовыйПользователь.Записать();
				
				ТекущийОбъект.УникальныйИдентификатор = НовыйПользователь.УникальныйИдентификатор;
				
			Иначе
				
				ПользовательСсылка.Пароль = Объект.Пароль;
				ПользовательСсылка.ПолноеИмя = Объект.Наименование;
				ПользовательСсылка.Роли.Очистить();
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администратор);
				Иначе
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
				КонецЕсли;
				
				ПользовательСсылка.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Объект.Логин;
		НовыйПользователь.Пароль = Объект.Пароль;
		НовыйПользователь.ПолноеИмя = Объект.Наименование;
		
		Если Объект.Роль = Перечисления.Роли.Администратор Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
		Иначе
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
		КонецЕсли;
		
		НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
		НовыйПользователь.Записать();
		ТекущийОбъект.УникальныйИдентификатор = НовыйПользователь.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры
